Центр_управления_производительностью_демо/src/InformationRegisters/ЖурналПоказателей/ЖурналПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналПоказателей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ГраницаЖК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГраницаЗЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шаг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Час</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Минута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.Показатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Центр_управления_производительностью_демо/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <predefined>
    <items>
      <name>Наполнитель</name>
      <description>Наполнитель</description>
    </items>
  </predefined>
  <attributes>
    <name>COMКоннекторЗарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБД</name>
    <comment>Имя базы данных на сервере СУБД</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБ</name>
    <comment>Имя информационной базы в кластере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <comment>Основной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПП1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализВзаимоблокировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализГранулярностиБлокировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализЗапросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализОжиданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализСерверныхВызовов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППОСВзаимоблокировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППОСТаймауты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПППроизвольныеСчетчикиОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогТрассировкиЛокальный</name>
    <comment>Локальный для сервера СУБД каталог трассировки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогТрассировкиСетевой</name>
    <comment>Сетевой каталог трассировки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВерсииСУБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначенаРольProcessAdmin</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Настроено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <comment>Основной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтладочныеСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортЦентральногоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимУправленияБлокировкойДанных</name>
    <type>
      <types>EnumRef.РежимыУправленияБлокировкойДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИБ</name>
    <comment>Кластер серверов 1С:Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверСУБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособАутентификации</name>
    <type>
      <types>EnumRef.СпособыАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОССервераСУБД</name>
    <type>
      <types>EnumRef.ТипыОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСУБД</name>
    <type>
      <types>EnumRef.ТипыСУБД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьТрассировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИменаКаталоговТЖ</name>
    <attributes>
      <name>СерверКластера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <comment>Полный путь файла logcfg.xml</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Локальный</name>
      <comment>Локальный для сервера 1С:Предприятия каталог технологического журнала</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сетевой</name>
      <comment>Сетевой каталог технологического журнала</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серверы</name>
    <attributes>
      <name>АгентЦКК</name>
      <type>
        <types>CatalogRef.АгентыЦКК</types>
      </type>
    </attributes>
    <attributes>
      <name>Сервер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособСбораСчетчиков</name>
      <type>
        <types>EnumRef.СпособыСбораСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯзыкОС</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатусыШагов</name>
    <attributes>
      <name>ИмяШага</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыШаговМастераНастройки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиОС</name>
    <attributes>
      <name>НомерСтрокиСервера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/CommonModules/МониторингВызовСервера/Module.bsl
// Записать текущие значения показателей производительности
//
Процедура ЗаписатьЗначенияПП(ИБ, Показатели, ЧастотаМониторинга, НомерЗаписи) Экспорт
	
	// Создать набор записей
	НаборЗаписей = РегистрыСведений.ЖурналПоказателей.СоздатьНаборЗаписей();
	Дата = ТекущаяДата();
	
	// Добавить в набор значения всех показателей
	НачатьТранзакцию();
	
	Для Каждого СтрокаПоказателя Из Показатели Цикл
		
		Блокировка = Новый БлокировкаДанных;
		СтрокаБлокировки = Блокировка.Добавить("РегистрСведений.ЖурналПоказателей");
		СтрокаБлокировки.УстановитьЗначение("ИнформационнаяБаза", ИБ);
		СтрокаБлокировки.УстановитьЗначение("Показатель", СтрокаПоказателя.Показатель);
		СтрокаБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		//Блокировка.Заблокировать();
		
		Если Не СтрокаПоказателя.Запись
		 Или Не СтрокаПоказателя.Показатель.Интерактивный Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьНабораЗаписей = НаборЗаписей.Добавить();
		ЗаписьНабораЗаписей.ИнформационнаяБаза = ИБ;
		ЗаписьНабораЗаписей.Период = Дата;
		ЗаписьНабораЗаписей.Год = Год(Дата);
		ЗаписьНабораЗаписей.Месяц = Месяц(Дата);
		ЗаписьНабораЗаписей.День = День(Дата);
		ЗаписьНабораЗаписей.Час = Час(Дата);
		ЗаписьНабораЗаписей.Минута = Минута(Дата);
		ЗаписьНабораЗаписей.Показатель = СтрокаПоказателя.Показатель;
		ЗаписьНабораЗаписей.НомерЗаписи = НомерЗаписи;
		ЗаписьНабораЗаписей.Значение = СтрокаПоказателя.Значение;
		ЗаписьНабораЗаписей.ГраницаЖК = СтрокаПоказателя.ГраницаЖК;
		ЗаписьНабораЗаписей.ГраницаЗЖ = СтрокаПоказателя.ГраницаЗЖ;
		ЗаписьНабораЗаписей.Шаг = ЧастотаМониторинга;
	КонецЦикла;
	
	// Записать показатели производительности в журнал
	НаборЗаписей.Записать(Ложь);
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ЗаписатьЗначенияПП()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьКаталогиТЖ(ИБ) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационнаяБазаИменаКаталоговТЖ.НомерСтроки КАК НомерСтроки,
	               |	ИнформационнаяБазаИменаКаталоговТЖ.СерверКластера КАК СерверКластера,
	               |	ИнформационнаяБазаИменаКаталоговТЖ.Конфигурация КАК Конфигурация,
	               |	ИнформационнаяБазаИменаКаталоговТЖ.Локальный КАК Локальный,
	               |	ИнформационнаяБазаИменаКаталоговТЖ.Сетевой КАК Сетевой
	               |ИЗ
	               |	Справочник.ИнформационныеБазы.ИменаКаталоговТЖ КАК ИнформационнаяБазаИменаКаталоговТЖ
	               |ГДЕ
	               |	ИнформационнаяБазаИменаКаталоговТЖ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ИБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЖ = Новый Структура("НомерСтроки,СерверКластера,Конфигурация,Локальный,Сетевой");
		ЗаполнитьЗначенияСвойств(СтрокаТЖ, Выборка);
		Результат.Добавить(СтрокаТЖ);
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции // ПолучитьКаталогиТЖ()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПроверитьПравильностьЗаполненияКаталоговТЖ(ИБ) Экспорт
	
	Расположения = МониторингВызовСервера.ПолучитьКаталогиТЖ(ИБ);
	
	Если Расположения.Количество() = 0 Тогда
		Возврат СловарьКлиентСервер.Получить("ОшибкаНеУказаноРасположениеТЖ");
	КонецЕсли;
	
	Для Каждого СтрокаРасположения Из Расположения Цикл
		Незаполненный = ОбщегоНазначенияКлиентСервер.НайтиНезаполненныйРеквизит(
			СтрокаРасположения, "Конфигурация, Локальный, Сетевой");
		
		Если Незаполненный <> Неопределено Тогда
			Синоним = ОбщегоНазначенияКлиентСервер.СинонимРеквизита(
				ИБ.Метаданные().ТабличныеЧасти.ИменаКаталоговТЖ.Реквизиты,
				Незаполненный);
			Возврат СловарьКлиентСервер.Получить("ЗначениеНеЗаполнено", Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ПроверитьПравильностьЗаполненияКаталоговТЖ()

// Проверить настройки трассировки
//
// Параметры:
//  ИБ - СправочникСсылка.ИнформационнаяБаза
//
// Возвращаеоме значение:
//  Строка - Описание того, что не настроено, Неопределено - все настроено
//
Функция ТрассировкаНастроена(ИБ) Экспорт
	
	Незаполненный = ОбщегоНазначенияКлиентСервер.НайтиНезаполненныйРеквизит(
		ИБ, "КаталогТрассировкиЛокальный");
	
	Если Незаполненный <> Неопределено Тогда
		Синоним = ОбщегоНазначенияКлиентСервер.СинонимРеквизита(ИБ.Метаданные().Реквизиты, Незаполненный);
		Возврат СловарьКлиентСервер.Получить("ЗначениеНеЗаполнено", Синоним);
	КонецЕсли;
	
КонецФункции // ТрассировкаНастроена()
